# Geo-YOLO Configuration
# Based on: Geometry-Aware Computational Reallocation for Efficient Object Detection
# Model Structure: Backbone(GAMS) + Neck(LAS: DPS-Conv + GPDA at P3/P4)

nc: 7  # Pedestrian, Rider, Car, Truck, Bus, Rare, Device
names: ['pedestrian', 'rider', 'car', 'truck', 'bus', 'rare_vehicle', 'traffic_device']

# Scales for YOLOv8n-based architecture
depth_multiple: 0.33
width_multiple: 0.50

# Hyperparameters
loss:
  box: EIoULoss
  box_weight: 5.0
  cls_weight: 0.5
  dfl_weight: 1.5

# Geo-YOLO Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 3, C2f, [128, True]]                  # 2
  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8
  - [-1, 6, GAMSBlock, [256, 1, [3,5,7], True]] # 4-P3: Geometry-Aware Multi-Scale Block
  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16
  - [-1, 6, C2f, [512, True]]                  # 6
  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32
  - [-1, 3, C2f, [1024, True]]                 # 8
  - [-1, 1, SPPF, [1024, 5]]                   # 9

# Geo-YOLO Head (Neck - LAS Strategy)
head:
  - [-1, 1, DPSConv, [512, 1, 1]]              # 10: Dual-Path Shuffle Conv
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 3, C2f, [512, False]]                 # 13

  - [-1, 1, DPSConv, [256, 1, 1]]              # 14: Dual-Path Shuffle Conv
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16
  - [-1, 3, GPDA, [256, 1, False]]             # 17-P3: Updated from GDAM

  - [-1, 1, DPSConv, [256, 3, 2]]              # 18: Dual-Path Shuffle Conv
  - [[-1, 13], 1, Concat, [1]]                 # 19
  - [-1, 3, GPDA, [512, 1, False]]             # 20-P4: Updated from GDAM

  - [-1, 1, DPSConv, [512, 3, 2]]              # 21: Dual-Path Shuffle Conv
  - [[-1, 9], 1, Concat, [1]]                  # 22
  - [-1, 1, C2f, [1024, False]]                # 23-P5: Selective Replacement (SRS)

  - [[17, 20, 23], 1, Detect, [nc]]            # 24: Detection Head
